/*Подсчитайте количество дней рождения, которые приходятся на каждый из дней недели.
Следует учесть, что необходимы дни недели текущего года, а не года рождения*/

-- взял таблицу из предыдущего задания и добавил новый столбец дата рождения

CREATE TABLE users1 (
	name VARCHAR(100) NOT NULL PRIMARY KEY,
	age INT UNSIGNED NOT NULL,
	birthday_at DATE NOT NULL
);

INSERT INTO users1 (name,age, birthday_at) VALUES
	('Tom', 39, "1980-06-27"),
	('Julia', 38, "1981-07-2"),
	('Diana', 4, "2014-09-19"),
	('Alex', 35, "1984-04-05"),
	('Elizabeth', 7, "2013-09-02"),
	('Luke', 1, "2019-06-27"),
	('Leo', 40, "1979-03-19"),
	('Kid', 2, "2017-05-05")
;

-- проверка
SELECT * FROM users1;
/*
+-----------+-----+-------------+
| name      | age | birthday_at |
+-----------+-----+-------------+
| Alex      |  35 | 1984-04-05  |
| Diana     |   4 | 2014-09-19  |
| Elizabeth |   7 | 2013-09-02  |
| Julia     |  38 | 1981-07-02  |
| Kid       |   2 | 2017-05-05  |
| Leo       |  40 | 1979-03-19  |
| Luke      |   1 | 2019-06-27  |
| Tom       |  39 | 1980-06-27  |
+-----------+-----+-------------+*/

SELECT DAYOFWEEK(birthday_at), COUNT(birthday_at) FROM users1 GROUP BY DAYOFWEEK(birthday_at);
/*
+------------------------+--------------------+
| DAYOFWEEK(birthday_at) | COUNT(birthday_at) |
+------------------------+--------------------+
|                      2 |                  2 |
|                      5 |                  3 |
|                      6 |                  3 |
+------------------------+--------------------+
*/